app/controllers/pre_orders_controller.rb

  def create
    @pre_order = PreOrder.new(params[:pre_order])
    if @pre_order.save
---
INSERT INTO "pre_orders" ("created_at", "email", "quantity", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 27 Jan 2012 22:21:34 UTC +00:00], ["email", "alexis.rondeau@gmail.com"], ["quantity", "1"], ["updated_at", Fri, 27 Jan 2012 22:21:34 UTC +00:00]]